export interface QuoteData {
  quotes: { quote: string; author: string }[];
}

// const url =
//   'https://gist.githubusercontent.com/camperbot/5a022b72e96c4c9585c32bf6a75f62d9/raw/e3c6895ce42069f0ee7e991229064f167fe8ccdc/quotes.json';

// export const reportError = ({ message }: { message: string }) => {
//   throw new Error(message);
// };

// export async function getQuotes(): Promise<QuoteData> {
//   try {
//     const response = await fetch(url);
//     const data = await response.json();

//     return { quotes: data.quotes };
//   } catch (error) {
//     let message;
//     if (error instanceof Error) message = error.message;
//     else message = String(error);

//     reportError({ message });
//     return {} as QuoteData;
//   }
// }

export const quoteArray: QuoteData = {
  quotes: [
    {
      quote:
        'А сьогодні в завтрашній день не всі можуть дивитися. Точніше дивитися можуть не тільки лиш усі, мало хто може це робити.',
      author: 'В. Кличко',
    },
    {
      quote:
        'Я зустрічався з багатьма міліціонерами, які загинули, з людьми-демонстрантами, які загинули, — і всі мені ставлять питання…',
      author: 'В. Кличко',
    },
    {
      quote: 'Щоб холодна вода перетворилася на гарячу, її потрібно підігріти.',
      author: 'В. Кличко',
    },
    {
      quote: 'Олександре, скажіть, будь ласка, як вас звати?',
      author: 'В. Кличко',
    },
    {
      quote:
        'У мене два заступники, чотири з яких уже місяць лежать у кабміні.',
      author: 'В. Кличко',
    },
    { quote: 'Нові дороги я перевіряю на двох колесах.', author: 'В. Кличко' },
    {
      quote:
        'Не в кілометрах відстань вимірюється. Дві години… 50 кілометрів потрібно їхати дві години.',
      author: 'В. Кличко',
    },
    {
      quote:
        'Депутатські пільги — це… Не можу підібрати слово… Я не знаю жодної країни у світі, де є пільги. І взагалі пільги — це атавізм. Згадав',
      author: 'В. Кличко',
    },
    {
      quote:
        'Нам потрібен не тільки час, нам потрібні гроші, тому що ми розуміємо, що нам не потрібні гроші.',
      author: 'В. Кличко',
    },
    {
      quote: 'Та система, яка сьогодні працює, не працює.',
      author: 'В. Кличко',
    },
    { quote: 'Я, наприклад, не бачу жодних запахів.', author: 'В. Кличко' },
    {
      quote:
        'А сьогодні в завтрашній день не всі можуть дивитися. Точніше дивитися можуть не тільки лиш усі, мало хто може це робити.',
      author: 'В. Кличко',
    },
    {
      quote:
        'Кожного з киян я прошу з розумінням ставитися до цієї проблеми. І просив би також усіх киян точно так само з особливим складовою звернутися до проблеми теплозбереження і підготовки до землі.',
      author: 'В. Кличко',
    },
    {
      quote:
        'Питання заробітної плати на сьогоднішній день не стоїть. Я навіть не знаю, де її отримують. Щиро можу сказати, я не знаю, яка в мене зарплата.',
      author: 'В. Кличко',
    },
    { quote: 'Далі можуть бути подальші дії.', author: 'В. Кличко' },
    { quote: 'У нас є, що було', author: 'В. Кличко' },
    {
      quote: 'Давайте не будем говорить о плохом, а лучше сделаем.',
      author: 'В. Янукович',
    },
    {
      quote:
        'Я вам скажу это не балалайка. Как говорят, одна палка, два струна - я хозяин вся страна.',
      author: 'В. Янукович',
    },
    {
      quote:
        'Как минимум не должны торговать зерном, а должны перерабатывать его в мясо или мясную продукцию.',
      author: 'В. Янукович',
    },
    {
      quote:
        'Почнеться тепло і в містах українських почнуть роздягатися жінки.',
      author: 'В. Янукович',
    },
    {
      quote: 'Когда увидишь своими руками, как говорят, глазами потрогаешь.',
      author: 'В. Янукович',
    },
    { quote: 'АСТАНАВИТЕСЬ!!!!', author: 'В. Янукович' },
    {
      quote: "Ви забили.. , забули про це? Я вам трошки напам'ятаю.",
      author: 'В. Янукович',
    },
    { quote: 'Зарази - втілення реформ.', author: 'В. Янукович' },
    {
      quote: 'Пропаган...проган..прога..пропагнан...пропагнандувати Україну.',
      author: 'В. Янукович',
    },
    {
      quote: 'Так Саша, ну шо ти, налий мені, шоб мені соромно не було.',
      author: 'В. Янукович',
    },
    {
      quote: 'Увікмни...уві...увікни...увікн... Вікмнить!',
      author: 'В. Янукович',
    },
    { quote: 'Хто це сказав? Підніміться!', author: 'В. Янукович' },
    {
      quote: 'У мене є колізія. Підпиздець і підпиздець.',
      author: 'Г. Мінаєв',
    },
    {
      quote:
        'Будете мешать – удалим вас, как зуб. Если не знаете, как это, пойдите к зубному.',
      author: 'Г. Кернес',
    },
    { quote: 'Кто ты есть такой? Ты кнопка, блять.', author: 'Г. Кернес' },
    {
      quote: 'Миша, у тебя скучное лицо, тебе денег никто не даст!',
      author: 'Г. Кернес',
    },
    {
      quote:
        'Ты можешь сказать это с выражением, в одном тоне, только с мимикой твоего лица..? Ну это просто постная хуй*я какая-то…',
      author: 'Г. Кернес',
    },
    { quote: 'Давай по-новой, Миша. Всё хуйня.', author: 'Г. Кернес' },
    {
      quote: 'Чё ты сказал — „жилые дома“, и начал чвякать-хуякать!!',
      author: 'Г. Кернес',
    },
    {
      quote:
        'Нам казали буде долар 45 при Зеленському, буде хаос в країні, буде війна...',
      author: 'В. Зеленський',
    },
    { quote: 'Хто я?', author: 'В. Зеленський' },
    { quote: 'Ці руки нічого не крали.', author: 'В. Ющенко' },
    {
      quote:
        'Сила Януковича, как и Бессмертного – я имею в виду Кощея – находится в яйцах.',
      author: 'Ю. Тимошенко',
    },
    {
      quote:
        'Выборы без дебатов – это как секс по телефону, когда никто ничего не понимает.',
      author: 'Ю. Тимошенко',
    },
  ],
};
